;; -*- no-byte-compile: t; -*-

(package! company-prescient :disable t)
(package! evil-matchit :disable t)
(package! flycheck-popup-tip :disable t)

(package! lsp-mode)
(package! lsp-ui)
(package! company-lsp)
(package! ccls :ignore t)
(package! clang-format)
(package! rainbow-mode)
(package! git-gutter+)
(package! centered-cursor-mode)
(package! rust-mode)
