;; -*- no-byte-compile: t; -*-

(disable-packages! company-prescient evil-matchit)
(package! lsp-mode)
(package! lsp-ui)
(package! company-lsp)
(package! ccls :ignore t)
(package! clang-format)
(package! rainbow-mode)
(package! git-gutter+)
(package! centered-cursor-mode)
