;; -*- no-byte-compile: t; -*-

(package! evil-matchit :disable t)
;; cc
(package! company-glsl :disable t)
(package! cuda-mode :disable t)
(package! demangle-mode :disable t)
(package! disaster :disable t)
(package! glsl-mode :disable t)
(package! modern-cpp-font-lock :disable t)
(package! opencl-mode :disable t)
;; python
(package! anaconda-mode :disable t)
(package! company-anaconda :disable t)
(package! nose :disable t)
(package! python-pytest :disable t)

(package! centered-cursor-mode)
(package! golden-ratio)

(package! explain-pause-mode
  :recipe (:host github :repo "lastquestion/explain-pause-mode"))

(package! protobuf-mode)
(package! rainbow-mode)
(package! benchmark-init)
