;; -*- no-byte-compile: t; -*-

(package! company-prescient :disable t)
(package! evil-matchit :disable t)
;; (package! flycheck-popup-tip :disable t)
(package! irony :disable t)
(package! company-irony :disable t)
(package! company-irony-c-headers :disable t)
(package! flycheck-irony :disable t)
(package! irony-eldoc :disable t)
(package! rtags :disable t)
(package! ivy-rtags :disable t)
;; (package! rust-mode :disable t)
(package! anaconda-mode :disable t)
(package! company-anaconda :disable t)

(package! ccls :ignore t)
(package! clang-format)
(package! rainbow-mode)
(package! centered-cursor-mode)
;; (package! rustic :ignore t)
;; (package! xterm-color) ;; for rustic
;; (package! lsp-mode :ignore t)
(package! golden-ratio)
